{
  "name99":["AR-RAHMAAN", "AR-RAHEEM", "AL-MALIK", "AL-QUDDUS", "AS-SALAM", "AL-MU’MIN", "AL-MUHAYMIN", "AL-AZIZ", "AL-JABBAR", "AL-MUTAKABBIR", "AL-KHAALIQ", "AL-BAARI", "AL-MUSAWWIR", "AL-GHAFFAAR",
      "AL-QAHHAAR", "AL-WAHHAB", "AR-RAZZAQ", "AL-FATTAH", "AL-ALIM", "AL-QAABID", "AL-BAASIT", "AL-KHAAFID", "AR-RAFI", "AL-MU’IZZ", "AL-MUZIL", "AS-SAMI’", "AL-BASEER", "AL-HAKAM", "AL-ADL", "AL-LATEEF", "AL-KHABEER",
      "AL-HALEEM", "AL-AZEEM", "AL-GHAFOOR", "ASH-SHAKOOR", "AL-ALIYY", "AL-KABEER", "AL-HAFIZ", "AL-MUQEET", "AL-HASEEB", "AL-JALEEL", "AL-KAREEM", "AR-RAQEEB", "AL-MUJEEB", "AL-WAASI’", "AL-HAKEEM", "AL-WADUD", "AL-MAJEED", "AL-BA’ITH", "ASH-SHAHEED",
      "AL-HAQQ", "AL-WAKEEL", "AL-QAWWIYY", "AL-MATEEN", "AL-WALIYY", "AL-HAMEED", "AL-MUHSEE", "AL-MUBDI", "AL-MUEED", "AL-MUHYI", "AL-MUMEET", "AL-HAYY", "AL-QAYYOOM", "AL-WAAJID", "AL-MAAJID", "AL-WAAHID", "AL-AHAD", "AS-SAMAD", "AL-QAADIR", "AL-MUQTADIR", "AL-MUQADDIM",
      "AL-MU’AKHKHIR", "AL-AWWAL", "AL-AKHIR", "AZ-ZAAHIR", "AL-BAATIN", "AL-WAALI", "AL-MUTA’ALI", "AL-BARR", "AT-TAWWAAB", "AL-MUNTAQIM", "AL-AFUWW", "AR-RA’OOF", "MAALIK-UL-MULK", "ZUL-JALAALI-WAL-IKRAM", "AL-MUQSIT", "AL-JAAMI’", "AL-GHANIYY", "AL-MUGHNI", "AL-MAANI’",
      "AD-DAARR", "AN-NAAFI’", "AN-NOOR", "AL-HAADI", "AL-BADI’", "AL-BAAQI", "AL-WAARIS", "AR-RASHEED", "AS-SABOOR"
    ],
  "name99sub":["THE BENEFICENT", "THE MERCIFUL", "THE ETERNAL LORD", "THE MOST SACRED", "THE EMBODIMENT OF PEACE", "THE INFUSER OF FAITH", "THE PRESERVER OF SAFETY",
      "THE MIGHTY ONE", "THE OMNIPOTENT ONE", "THE DOMINANT ONE", "THE CREATOR", "THE EVOLVER", "THE FLAWLESS SHAPER", "THE GREAT FORGIVER", "THE ALL-PREVAILING ONE", "THE SUPREME BESTOWER",
      "THE TOTAL PROVIDER", "THE SUPREME SOLVER", "THE ALL-KNOWING ONE", "THE RESTRICTING ONE", "THE EXTENDER", "THE REDUCER", "THE ELEVATING ONE", "THE HONOURER-BESTOWER", "THE ABASER", "THE ALL-HEARER", "THE ALL-SEEING",
      "THE IMPARTIAL JUDGE", "THE EMBODIMENT OF JUSTICE", "THE KNOWER OF SUBTLETIES", "THE ALL-AWARE ONE", "THE CLEMENT ONE", "THE MAGNIFICENT ONE", "THE GREAT FORGIVER", "THE ACKNOWLEDGING ONE", "THE SUBLIME ONE",
      "THE GREAT ONE", "THE GUARDING ONE", "THE SUSTAINING ONE", "THE RECKONING ONE", "THE MAJESTIC ONE", "THE BOUNTIFUL ONE", "THE WATCHFUL ONE", "THE RESPONDING ONE", "THE ALL-PERVADING ONE", "THE WISE ONE", "THE LOVING ONE", "THE GLORIOUS ONE", "THE INFUSER OF NEW LIFE", "THE ALL OBSERVING WITNESS", "THE EMBODIMENT OF TRUTH", "THE UNIVERSAL TRUSTEE",
      "THE STRONG ONE", "THE FIRM ONE", "THE PROTECTING ASSOCIATE", "THE SOLE-LAUDABLE ONE", "THE ALL-ENUMERATING ONE", "THE ORIGINATOR", "THE RESTORER", "THE MAINTAINER OF LIFE", "THE INFLICTOR OF DEATH", "THE ETERNALLY LIVING ONE", "THE SELF-SUBSISTING ONE", "THE POINTING ONE", "THE ALL-NOBLE ONE", "THE ONLY ONE", "THE SOLE ONE", "THE SUPREME PROVIDER", "THE OMNIPOTENT ONE", "THE ALL AUTHORITATIVE ONE", "THE EXPEDITING ONE",
      "THE DELAYER", "THE VERY FIRST", "THE INFINITE LAST ONE", "THE PERCEPTIBLE", "THE IMPERCEPTIBLE", "THE HOLDER OF SUPREME AUTHORITY", "THE EXTREMELY EXALTED ONE", "THE FOUNTAIN-HEAD OF TRUTH", "THE EVER-ACCEPTOR OF REPENTANCE", "THE RETALIATOR", "THE SUPREME PARDONER", "THE BENIGN ONE", "THE ETERNAL POSSESSOR OF SOVEREIGNTY", "THE POSSESSOR OF MAJESTY AND HONOUR", "THE JUST ONE", "THE ASSEMBLER OF SCATTERED CREATIONS", "THE SELF-SUFFICIENT ONE", "THE BESTOWER OF SUFFICIENCY", "THE PREVENTER",
      "THE DISTRESSOR", "THE BESTOWER OF BENEFITS", "THE PRIME LIGHT", "THE PROVIDER OF GUIDANCE", "THE UNIQUE ONE", "THE EVER SURVIVING ONE", "THE ETERNAL INHERITOR", "THE GUIDE TO PATH OF RECTITUDE", "THE EXTENSIVELY ENDURING ONE"
   ],
   "name99details":[
   "He who wills goodness and mercy for all His creatures", "He who acts with extreme kindness", "The Sovereign Lord, The One with the complete Dominion, the One Whose Dominion is clear from imperfection",
      "The One who is pure from any imperfection and clear from children and adversaries", "The One who is free from every imperfection.", "The One who witnessed for Himself that no one is God but Him. And He witnessed for His believers that they are truthful in their belief that no one is God but Him"
      , "The One who witnesses the saying and deeds of His creatures", "The Strong, The Defeater who is not defeated", "The One that nothing happens in His Dominion except that which He willed",
      "The One who is clear from the attributes of the creatures and from resembling them.", "The One who brings everything from non-existence to existence", "The Maker, The Creator who has the Power to turn the entities.", "The One who forms His creatures in different pictures.",
      "The Forgiver, The One who forgives the sins of His slaves time and time again.", "The Dominant, The One who has the perfect Power and is not unable over anything.", "The One who is Generous in giving plenty without any return. He is everything that benefits whether Halal or Haram.",
      "The Sustainer, The Provider.", "The Opener, The Reliever, The Judge, The One who opens for His slaves the closed worldly and religious matters.", "The Knowledgeable; The One nothing is absent from His knowledge", "The Constrictor, The Withholder, The One who constricts the sustenance by His wisdom and expands and widens it with His Generosity and Mercy.",
      "The Englarger, The One who constricts the sustenance by His wisdom and expands and widens it with His Generosity and Mercy.", "The Abaser, The One who lowers whoever He willed by His Destruction and raises whoever He willed by His Endowment.",
      "The Exalter, The Elevator, The One who lowers whoever He willed by His Destruction and raises whoever He willed by His Endowment.", "He gives esteem to whoever He willed, hence there is no one to degrade Him; And He degrades whoever He willed, hence there is no one to give Him esteem.",
      "The Dishonourer, The Humiliator, He gives esteem to whoever He willed, hence there is no one to degrade Him; And He degrades whoever He willed, hence there is no one to give Him esteem.", "The Hearer, The One who Hears all things that are heard by His Eternal Hearing without an ear, instrument or organ.",
      "The All-Noticing, The One who Sees all things that are seen by His Eternal Seeing without a pupil or any other instrument.", "The Judge, He is the Ruler and His judgment is His Word.", "The Just, The One who is entitled to do what He does.", "The Subtle One, The Gracious, The One who is kind to His slaves and endows upon them.", "The One who knows the truth of things.",
      "The Forebearing, The One who delays the punishment for those who deserve it and then He might forgive them.", "The Great One, The Mighty, The One deserving the attributes of Exaltment, Glory, Extolement, and Purity from all imperfection.", "The All-Forgiving, The Forgiving, The One who forgives a lot.", "The Grateful, The Appreciative, The One who gives a lot of reward for a little obedience.",
      "The Most High, The One who is clear from the attributes of the creatures.", "The Most Great, The Great, The One who is greater than everything in status.", "The Preserver, The Protector, The One who protects whatever and whoever He willed to protect.", "The Maintainer, The Guardian, The Feeder, The One who has the Power.", "The Reckoner, The One who gives the satisfaction.",
      "The Sublime One, The Beneficent, The One who is attributed with greatness of Power and Glory of status.", "The Generous One, The Gracious, The One who is attributed with greatness of Power and Glory of status.", "The Watcher, The One that nothing is absent from Him. Hence it’s meaning is related to the attribute of Knowledge.", "The Responsive, The Hearkener, The One who answers the one in need if he asks Him and rescues the yearner if he calls upon Him.",
      "The Vast, The All-Embracing, The Knowledgeable.", "The Wise, The Judge of Judges, The One who is correct in His doings.", "The One who loves His believing slaves and His believing slaves love Him. His love to His slaves is His Will to be merciful to them and praise them", "The Most Glorious One, The One who is with perfect Power, High Status, Compassion, Generosity and Kindness.", "The Resurrector, The Raiser (from death), The One who resurrects His slaves after death for reward and/or punishment.",
      "The Witness, The One who nothing is absent from Him.", "The Truth, The True, The One who truly exists.", "The Trustee, The One who gives the satisfaction and is relied upon.", "The Most Strong, The Strong, The One with the complete Power", "The One with extreme Power which is un-interrupted and He does not get tired.", "The Protecting Friend, The Supporter.", "The Praiseworthy, The praised One who deserves to be praised.", "The Counter, The Reckoner, The One who the count of things are known to him.",
      "The One who started the human being. That is, He created him.", "The Reproducer, The One who brings back the creatures after death", "The Restorer, The Giver of Life, The One who took out a living human from semen that does not have a soul. He gives life by giving the souls back to the worn out bodies on the resurrection day and He makes the hearts alive by the light of knowledge.", "The Creator of Death, The Destroyer, The One who renders the living dead.", "The Alive, The One attributed with a life that is unlike our life and is not that of a combination of soul, flesh or blood.",
      "The One who remains and does not end.", "The Perceiver, The Finder, The Rich who is never poor. Al-Wajd is Richness.", "The Glorious, He who is Most Glorious.", "The Unique, The One, The One without a partner", "The One", "The Eternal, The Independent, The Master who is relied upon in matters and reverted to in ones needs.", "The Able, The Capable, The One attributed with Power.", "The Powerful, The Dominant, The One with the perfect Power that nothing is withheld from Him.", "The Expediter, The Promoter, The One who puts things in their right places. He makes ahead what He wills and delays what He wills.",
      "The Delayer, the Retarder, The One who puts things in their right places. He makes ahead what He wills and delays what He wills.", "The First, The One whose Existence is without a beginning.", "The Last, The One whose Existence is without an end.", "The Manifest, The One that nothing is above Him and nothing is underneath Him, hence He exists without a place. He, The Exalted, His Existence is obvious by proofs and He is clear from the delusions of attributes of bodies.", "The Hidden, The One that nothing is above Him and nothing is underneath Him, hence He exists without a place. He, The Exalted, His Existence is obvious by proofs and He is clear from the delusions of attributes of bodies."
      , "The Governor, The One who owns things and manages them.", "The Most Exalted, The High Exalted, The One who is clear from the attributes of the creation.", "The Source of All Goodness, The Righteous, The One who is kind to His creatures, who covered them with His sustenance and specified whoever He willed among them by His support, protection, and special mercy.", "The Relenting, The One who grants repentance to whoever He willed among His creatures and accepts his repentance.", "The Avenger, The One who victoriously prevails over His enemies and punishes them for their sins. It may mean the One who destroys them.", "The Forgiver, The One with wide forgiveness.", "The Compassionate, The One with extreme Mercy. The Mercy of Allah is His will to endow upon whoever He willed among His creatures.",
      "The One who controls the Dominion and gives dominion to whoever He willed.", "The Lord of Majesty and Bounty, The One who deserves to be Exalted and not denied.", "The Equitable, The One who is Just in His judgment.", "The Gatherer, The One who gathers the creatures on a day that there is no doubt about, that is the Day of Judgment.", "The One who does not need the creation.",
      "The Enricher, The One who satisfies the necessities of the creatures.", "The Withholder.", "The One who makes harm reach to whoever He willed and benefit to whoever He willed.", "The Propitious, The One who makes harm reach to whoever He willed and benefit to whoever He willed.", "The Light, The One who guides.",
      "The Guide, The One whom with His Guidance His believers were guided, and with His Guidance the living beings have been guided to what is beneficial for them and protected from what is harmful to them.", "The Incomparable, The One who created the creation and formed it without any preceding example.", "The Everlasting, The One that the state of non-existence is impossible for Him.", "The Heir, The One whose Existence remains.", "The Guide to the Right Path, The One who guides.", "The Patient, The One who does not quickly punish the sinners."
   ]
}
